{"text": "I am a 32-year-old female living in the coastal city of Mangalore, Karnataka. For the past three weeks, I've been struggling with a persistent cough and fever that seems to get worse at night. Initially, I thought it was just a common cold, and I tried over-the-counter medications, but nothing seemed to help. The cough is dry, but at times it feels like I'm bringing up mucus. I've experienced fatigue and body aches, making it hard for me to concentrate at work, where I manage a small hotel. I don't have any prior serious health issues, nor have I undergone any surgeries or been hospitalized. My allergies to dust and pollen have acted up lately, but I've never been allergic to food or any medications. I maintain a balanced diet and try to exercise regularly, but my physical activity has decreased due to this illness. I usually sleep well, but this cough is interrupting my rest. Additionally, I don’t consume alcohol or tobacco. My family has no significant history of chronic illnesses. I’ve not been feeling anxious or stressed at work, but this situation is causing me concern since it's affecting my daily life. Access to clean water is good here, and my housing is adequate. I wonder if I should seek medical help or if this is something that might resolve on its own in time.", "extracted": {"age": 32, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Mangalore", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter medications", "immunisation_status": null, "allergies": "dust, pollen", "family_history": null, "diet": "balanced diet", "physical_activity": "decreased due to illness", "sleep_pattern": "interrupted sleep", "alcohol": "no", "tobacco": "no", "mental_health": "not anxious or stressed", "work_stress": "concerned due to illness", "environmental_exposure": "dust, pollen", "housing": "adequate", "clean_water": "good", "occupation": "hotel manager", "symptom_duration_map": {"cough": "3 weeks", "fever": "3 weeks", "fatigue": "3 weeks", "body_aches": "3 weeks"}, "symptom_intensity_map": {"cough": "severe", "fever": "moderate", "fatigue": "high", "body_aches": "high"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.7, "uid": "af93512c"}
{"text": "Hello, I’m a 29-year-old male living in Pune, Maharashtra. For the past two weeks, I've been experiencing a severe headache that often feels like a pounding sensation. It started off mild, but now it has escalated to the point where it’s taking a toll on my daily activities. I also feel nauseous from time to time, which makes it hard for me to eat. As for my medical history, I have been diagnosed with sinusitis in the past, but I haven’t had any surgeries or hospitalizations. I don’t have any chronic illnesses, and I'm not on any medication currently. My lifestyle isn't perfect; I try to eat healthily, but I often skip meals due to my busy job as a software developer. I also don’t exercise regularly and have been feeling quite stressed due to work deadlines. I typically sleep around 5-6 hours a night, which I know isn't enough. I don’t smoke or consume alcohol, but I do drink a lot of coffee to stay awake during long work hours. My family has a history of migraines, which makes me wonder if there is a hereditary component to what I’m experiencing. The headache worsens with exposure to bright lights or loud noises, and it's starting to affect my mental health, leaving me feeling anxious and fatigued. I live in a rented apartment that has access to clean water, but I often find it hard to keep my living space tidy because of my workload. I’m really concerned about this headache and its impact on my life.", "extracted": {"age": 29, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": ["sinusitis"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": ["migraines"], "diet": "irregular, skips meals", "physical_activity": "low", "sleep_pattern": "5-6 hours", "alcohol": "no", "tobacco": "no", "mental_health": "anxiety and fatigue", "work_stress": "high", "environmental_exposure": "bright lights, loud noises", "housing": "rented apartment", "clean_water": "yes", "occupation": "software developer", "symptom_duration_map": {"headache": "14 days"}, "symptom_intensity_map": {"headache": "severe", "nausea": "moderate"}}, "label_leaf_id": "headache_migraine", "risk": 0.8, "uid": "ee24b49f"}
{"text": "I am a 34-year-old woman living in Mumbai, and for the past three weeks, I've been experiencing severe headaches that often accompany nausea and occasional dizziness. These headaches have been quite debilitating, making it difficult for me to concentrate at work, where I manage a small team. I have a family history of migraines—my mother suffers from them, and I suspect this might be hereditary. I don't drink alcohol and have never smoked, but I do have a fairly stressful job which can sometimes overwhelm me. My sleep has also been disrupted recently due to these headaches; I usually get about 5 hours of sleep a night, but it has become quite irregular. I suspect the stress from work might be contributing, but I am also concerned about whether there could be some other underlying cause. I eat a balanced diet rich in fruits and vegetables but admittedly don’t exercise as much as I should. I’ve tried over-the-counter pain relievers, but they only provide temporary relief. Overall, I'm quite worried about how this is affecting my daily life and whether I should seek further medical advice.", "extracted": {"age": 34, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers", "immunisation_status": null, "allergies": null, "family_history": "mother suffers from migraines", "diet": "balanced diet rich in fruits and vegetables", "physical_activity": "not exercising as much as should", "sleep_pattern": "irregular, about 5 hours a night", "alcohol": "no", "tobacco": "no", "mental_health": "stress from work", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "manager", "symptom_duration_map": {"headache": "three weeks", "nausea": "intermittent", "dizziness": "occasional"}, "symptom_intensity_map": {"headache": "severe", "nausea": "mild", "dizziness": "mild"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "2525bba7"}
{"text": "I am a 34-year-old woman from Jaipur, Rajasthan, and for the last two weeks, I've been experiencing severe headaches that just won't go away. Initially, I thought it was just stress since I work as a teacher, and my job can be quite demanding, especially with the exams approaching. However, the headache has become increasingly intense, often making it difficult for me to focus on my work or enjoy time with my family. Along with the headache, I've also noticed some mild nausea and sensitivity to light, which has made things even worse. I have a family history of migraines, as my mother used to suffer from them as well. I try to maintain a balanced diet, mostly vegetarian, and I engage in moderate physical activity by walking daily. My sleep pattern has been decent, though lately, I've been waking up more frequently due to the discomfort. Additionally, I don't consume alcohol or tobacco, and I keep my living environment clean. However, I do live in a bustling area and am occasionally exposed to pollution. Considering all of this, I'm quite worried and would like to know if this could be something serious or just a case of prolonged stress.", "extracted": {"age": 34, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": null, "location": "Jaipur", "region": "Rajasthan", "past_conditions": "none", "surgeries": "none", "hospitalisations": "none", "chronic_illnesses": "none", "medication_history": "none", "immunisation_status": "up to date", "allergies": "none", "family_history": "migraines", "diet": "vegetarian", "physical_activity": "moderate", "sleep_pattern": "decent", "alcohol": "none", "tobacco": "none", "mental_health": "none", "work_stress": "high", "environmental_exposure": "pollution", "housing": "clean", "clean_water": "yes", "occupation": "teacher", "symptom_duration_map": {"headache": "14 days", "nausea": "14 days", "light sensitivity": "14 days"}, "symptom_intensity_map": {"headache": "severe", "nausea": "mild", "light sensitivity": "moderate"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "90138f1b"}
{"text": "I am a 34-year-old male from Delhi, and I've been struggling with a persistent cough for the past few weeks, which seems to be getting worse. It started off as a mild dry cough, but now it's accompanied by a slight fever and occasional chills, especially at night. I've been feeling fatigued and have lost my appetite. I live in a densely populated area with high pollution levels, which may not be helping my situation. I have no significant past medical history, no known allergies, and I haven't undergone any major surgeries. I work as a software engineer, often dealing with work-related stress, and I generally try to maintain a balanced diet, but I’ve noticed that my current condition has altered my eating habits. I do not smoke but enjoy drinking alcohol occasionally. I have not been vaccinated for the flu this year. My sleep is often disturbed due to the cough, and I've been unable to get a full night's rest. I am concerned that this cough could be something more serious, especially since it has lasted for over three weeks now, and I feel it is affecting my daily life considerably.", "extracted": {"age": 34, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Delhi", "region": "Delhi", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "not vaccinated for flu this year", "allergies": null, "family_history": null, "diet": "generally balanced but altered due to current condition", "physical_activity": null, "sleep_pattern": "disturbed sleep due to cough", "alcohol": "occasional", "tobacco": "no", "mental_health": "work-related stress", "work_stress": "high", "environmental_exposure": "high pollution levels", "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"cough": "3 weeks", "fever": "persistent", "fatigue": "persistent"}, "symptom_intensity_map": {"cough": "severe", "fever": "mild", "fatigue": "moderate"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.8, "uid": "74592895"}
{"text": "I am a 32-year-old male from Pune, Maharashtra. For the past week, I've been experiencing a severe headache that starts in the morning and lasts throughout the day, making it difficult to focus at work. I feel a constant throbbing primarily around my temples, and it sometimes radiates to the back of my head. I'm not sure if it's a migraine, but it gets excruciating, especially when I'm exposed to bright light or loud sounds. Along with the headache, I've had some nausea and occasional dizziness, although I do not vomit. My work involves looking at screens for prolonged periods, and I suspect that might be contributing to my condition. I usually try to stay hydrated but have noticed I might not be drinking enough water lately. I don't have any significant medical history besides mild seasonal allergies, but I haven't had any surgeries or hospitalizations in the past. I am not on any regular medications, and my vaccination status is complete. I also do not smoke or drink alcohol, and I have a fairly balanced diet. My family history is generally healthy without any major conditions. This headache issue has been quite disabling, and I'm starting to feel anxious about it, which adds another layer of stress to my daily life.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": "mild seasonal allergies", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "none", "immunisation_status": "complete", "allergies": "mild seasonal allergies", "family_history": "generally healthy", "diet": "fairly balanced", "physical_activity": null, "sleep_pattern": null, "alcohol": "none", "tobacco": "none", "mental_health": "anxious about health issue", "work_stress": "high due to headache", "environmental_exposure": "prolonged screen time", "housing": null, "clean_water": null, "occupation": "screen work", "symptom_duration_map": {"headache": "7 days"}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "9e876ac7"}
{"text": "Hello, I’m a 35-year-old male from Mumbai, and I've been experiencing some troubling symptoms lately. It all started about two weeks ago when I noticed a persistent headache that just wouldn’t go away. At first, I thought it was just stress from work as I've been under a lot of pressure. However, the headache has transformed into a severe pain that's often accompanied by some nausea. I’ve tried over-the-counter painkillers, but they barely take the edge off. Along with this, I’ve also had episodes of dizziness and occasionally feel a bit lightheaded. I don’t have any chronic illnesses, nor have I had any recent surgeries or hospitalizations. I’ve been generally healthy, maintaining a balanced diet with regular physical activity. My family has a history of migraines, so I’m wondering if that could be affecting me. Work has been quite stressful, and I spend most of my days in a sedentary position in front of a computer. My sleep pattern has also been somewhat irregular lately due to the headache. I don’t consume alcohol or tobacco, but I occasionally feel anxious about my work deadlines. I live in a clean area with access to clean water. Although I've had a few allergy issues in the past, they were minor. I'm starting to worry about these symptoms, especially since they seem to be getting worse, and I wonder if I should consult a doctor soon.", "extracted": {"age": 35, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter painkillers", "immunisation_status": null, "allergies": "minor allergies", "family_history": "history of migraines", "diet": "balanced diet", "physical_activity": "regular physical activity", "sleep_pattern": "irregular", "alcohol": "no", "tobacco": "no", "mental_health": "anxious about work deadlines", "work_stress": "high", "environmental_exposure": null, "housing": "clean area", "clean_water": "yes", "occupation": "office worker", "symptom_duration_map": {"headache": 14, "nausea": 14, "dizziness": 14}, "symptom_intensity_map": {"headache": "severe", "nausea": "mild", "dizziness": "mild"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "e3a6ce9d"}
{"text": "I am a 32-year-old male from Pune, Maharashtra, and for the past two weeks, I have been experiencing severe headaches that come and go throughout the day. The headaches started off mild but have ramped up in intensity, often causing me to feel nauseous and sensitive to light and sound. I have not experienced anything like this before, and I find it hard to concentrate on my work as an IT professional. I usually have a pretty good diet, consisting of home-cooked meals, and I try to stay active by going for a run a couple of times a week, but my physical activity level has dropped due to the constant pain. I don’t have any known chronic illnesses, and my past medical history is pretty clear apart from occasional colds. I’m generally a healthy person, and I don’t take any regular medications. I don't smoke or drink alcohol, and my sleep pattern has been disrupted lately; I find it hard to fall asleep because of the pain. I’ve also been under a lot of work stress lately, with tight deadlines contributing to my anxiety. I live in a rented apartment with clean water access, and I haven’t had any recent encounters with allergens that I can think of. My family has a history of migraines, so I am starting to worry that this could be related. I would appreciate any advice or guidance on what my next steps should be.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "migraines", "diet": "home-cooked meals", "physical_activity": "running couple of times a week", "sleep_pattern": "disrupted, hard to fall asleep", "alcohol": "none", "tobacco": "none", "mental_health": "under a lot of work stress", "work_stress": "high, with tight deadlines", "environmental_exposure": null, "housing": "rented apartment", "clean_water": true, "occupation": "IT professional", "symptom_duration_map": {"headache": "2 weeks"}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "f4288fa7"}
{"text": "Hello, I hope this message finds you well. I’m a 28-year-old male living in Pune, Maharashtra, and for the past week, I’ve been struggling with a fever that seems to come and go. The fever is accompanied by a persistent cough, which has become quite severe, making it difficult for me to get through my daily routine. I don’t recall having any recent infections or illnesses, but this feels different, and my energy levels are really low. I have no prior history of chronic illnesses, and I’m not on any regular medications. I try to maintain a balanced diet, mostly vegetarian, and I do exercise occasionally. However, I have had issues with sleep recently, often waking up multiple times at night. There has been no sign of allergies in the past, and I don't smoke or drink. I live in a relatively good neighborhood, and I believe we have access to clean drinking water. However, I do work in a high-stress IT job, which might have contributed to my health condition. Given that my symptoms have persisted for a week and their intensity seems to be increasing, I’m quite worried and feel it’s time to seek some medical advice.", "extracted": {"age": 28, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "vegetarian", "physical_activity": "occasional exercise", "sleep_pattern": "poor, wakes up frequently", "alcohol": "none", "tobacco": "none", "mental_health": "high stress from work", "work_stress": "high", "environmental_exposure": null, "housing": "good neighborhood", "clean_water": "yes", "occupation": "IT", "symptom_duration_map": {"fever": 7, "cough": 7}, "symptom_intensity_map": {"fever": "severe", "cough": "severe"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.8, "uid": "bfcd378e"}
{"text": "Hello, I’m a 35-year-old male from Pune, Maharashtra, and I’ve been experiencing severe headaches for the past three weeks. Initially, I thought it was just fatigue or stress because of my long hours at the IT job, but it has progressively gotten worse. The pain is usually on one side of my head and shoots down to my neck. I also feel quite nauseous at times, and I’ve had difficulty concentrating at work. I have no previous history of migraines or chronic illnesses, though I did have a bout of seasonal flu last year, but I recovered completely without any complications. I maintain a balanced diet, mostly vegetarian, and I try to exercise at least three times a week. I don’t consume alcohol or tobacco. However, I often feel stressed due to tight deadlines at my job, which sometimes disrupts my sleep; I average around 5-6 hours of sleep a night. I live in a rented apartment that has access to clean water, but there are occasional issues with electricity. I am current with my immunizations and have no known allergies. I’m worried as these headaches seem to be disrupting my life more than I anticipated. Could this be something serious, and what should I do next?", "extracted": {"age": 35, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": ["seasonal flu"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "current", "allergies": null, "family_history": null, "diet": "vegetarian", "physical_activity": "exercise three times a week", "sleep_pattern": "5-6 hours of sleep", "alcohol": "no", "tobacco": "no", "mental_health": "work stress", "work_stress": "tight deadlines", "environmental_exposure": "occasional electricity issues", "housing": "rented apartment", "clean_water": "yes", "occupation": "IT professional", "symptom_duration_map": {"headache": "3 weeks"}, "symptom_intensity_map": {"headache": "severe", "nausea": "moderate"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "645ad7f3"}
{"text": "Hello, I’m a 28-year-old male from Pune, Maharashtra. For the past week, I've been experiencing a persistent and severe headache that doesn’t seem to go away, accompanied by nausea and heightened sensitivity to light. Initially, I thought it was just stress from work, but the pain has intensified, making it difficult to focus on my tasks. I generally have a sedentary lifestyle due to desk work and don’t engage in regular physical activity, which has been affecting my sleeping pattern as well—I’ve had trouble falling asleep and sometimes feel restless. I have no known history of migraines or chronic illnesses, and I’m not on any medications. I don’t have any allergies to speak of; however, I do consume alcohol occasionally on weekends, and I used to smoke, but I've quit about a year ago. I keep to a mostly vegetarian diet, with a good mix of fruits and vegetables, and I try to stay hydrated. My family does have a history of migraine headaches, which concerns me. Given the intensity and duration of my symptoms, I'm starting to worry it might be something more serious. I’d really appreciate some guidance on what steps to take next for relief.", "extracted": {"age": 28, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "migraine headaches", "diet": "mostly vegetarian", "physical_activity": "sedentary", "sleep_pattern": "trouble falling asleep and restless", "alcohol": "occasional", "tobacco": "quit", "mental_health": null, "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "desk job", "symptom_duration_map": {"headache": "7 days"}, "symptom_intensity_map": {"headache": "severe", "nausea": "moderate", "sensitivity to light": "high"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "40434e38"}
{"text": "Namaste, I am a 32-year-old male from Pune, Maharashtra, and for the past two weeks, I've been dealing with a persistent cough and intermittent fever. Initially, it started as a mild cough, but it has become quite severe, keeping me awake at night and making it hard for me to carry out my daily activities. The fever varies, sometimes reaching 101°F, accompanied by body aches and fatigue. I work as a software engineer, and with the ongoing work stress and long hours at my desk, I feel drained. My diet is mostly vegetarian, but I am not very consistent with my meals. I don't smoke or drink alcohol, and there’s no significant history of chronic illnesses in my family. I had a mild bout of asthma as a child, but I have not been hospitalized for any serious conditions before. I've not had any surgeries, and my immunization status is up to date. I do not have any known allergies. Due to the cough, my physical activity has decreased significantly, and I feel mentally exhausted. I wonder if my prolonged exposure to air conditioning and dusty environments at work could be aggravating my condition. I am hoping to find out if I need to see a doctor for this persistent cough and fever.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": "mild asthma", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": "no significant chronic illnesses", "diet": "vegetarian, inconsistent meals", "physical_activity": "decreased significantly", "sleep_pattern": "disturbed due to cough", "alcohol": "no", "tobacco": "no", "mental_health": "mentally exhausted", "work_stress": "high", "environmental_exposure": "air conditioning, dusty environments", "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"cough": "14 days", "fever": "14 days"}, "symptom_intensity_map": {"cough": "severe", "fever": "intermittent, reaching 101°F"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.7, "uid": "32f08e3b"}
{"text": "Hello, I'm a 35-year-old woman from Pune, Maharashtra. For the past two weeks, I've been experiencing persistent headaches that seem to worsen as the day progresses. I initially thought it was just stress from work since I've been under a lot of pressure lately, but the pain has become more severe and it now often comes with nausea and sensitivity to light. I do have a history of migraines, but this feels different, like a pressing weight on my forehead that doesn’t ease with over-the-counter painkillers. I haven’t had any recent surgeries or hospitalizations, but I do worry because I've been feeling more fatigued than usual, and my sleep has been disrupted; I often wake up in the middle of the night feeling anxious. My diet has been mostly healthy, filled with fruits and vegetables, and I try to stay active by jogging a few times a week. However, I’ve been drinking more coffee to cope with my headaches and my work stress. There is no significant family history of chronic illnesses, and I’m usually in good health aside from my migraines. I'm also up to date with my immunizations and have no known allergies. This headache is unlike anything I’ve experienced before and it’s affecting my daily activities, so I’m becoming more anxious about it. Could this be a sign of something more serious?", "extracted": {"age": 35, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": "migraines", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter painkillers", "immunisation_status": "up to date", "allergies": null, "family_history": null, "diet": "mostly healthy with fruits and vegetables", "physical_activity": "jogging a few times a week", "sleep_pattern": "disrupted, waking up in the middle of the night", "alcohol": "none", "tobacco": "none", "mental_health": "anxious about headaches", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "professional", "symptom_duration_map": {"headache": "14 days"}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "703e3ed8"}
{"text": "I am a 34-year-old male living in Mumbai, Maharashtra. For the past week, I've been experiencing a persistent and severe headache that seems to be worsening. It started as a dull ache, but it has increasingly intensified, affecting my daily activities and concentration at work. Alongside the headache, I've also been feeling nauseous at times and have some sensitivity to light and sound. I do not have any known allergies and have not had any major surgeries or hospitalizations in the past. My sleep pattern has been irregular lately, with poor quality sleep and difficulty falling asleep. I lead a sedentary lifestyle due to my desk job, but I make sure to eat a balanced diet with a mix of vegetables and proteins. I don't smoke or consume alcohol. I have a family history of migraines, but I have never experienced anything quite like this before. I don't have any chronic illnesses or significant medical history, and my immunization status is up to date. Environmental factors in my area, like air quality issues, have been concerning lately, which might be contributing to my symptoms. I'm quite worried about this headache, as it's affecting my work and overall well-being, and I'm unsure if I should visit a doctor immediately or if it might pass with some rest.", "extracted": {"age": "34", "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": "migraines", "diet": "balanced diet with mix of vegetables and proteins", "physical_activity": "sedentary lifestyle", "sleep_pattern": "irregular, poor quality sleep, difficulty falling asleep", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": null, "environmental_exposure": "concerns about air quality", "housing": null, "clean_water": null, "occupation": "desk job", "symptom_duration_map": {"headache": "7 days"}, "symptom_intensity_map": {"headache": "severe", "nausea": "moderate", "sensitivity to light": "mild", "sensitivity to sound": "mild"}}, "label_leaf_id": "headache_migraine", "risk": 0.8, "uid": "2084276e"}
{"text": "Hello, I'm a 32-year-old male living in Bangalore, Karnataka. For the past two weeks, I've been experiencing a persistent cough that seems to worsen in the evening. Along with that, I've developed a fever that spikes to about 101°F almost every night. I find it hard to breathe deeply without feeling a tightness in my chest. I don't have any known chronic illnesses, but I did have a mild asthma condition as a child, although I haven't experienced any symptoms for years. My family has a history of respiratory issues, which worries me. I try to maintain a balanced diet, including fruits and vegetables, and I generally sleep around six hours a night. However, I've been quite stressed at work lately, which has led to some irregular sleeping patterns. I also live in a densely populated area, and I'm concerned that environmental factors, like pollution, might be aggravating my symptoms. I don't smoke or consume alcohol, but the cough has impacted my ability to concentrate during the day, making me anxious. I've been taking over-the-counter cough syrup, but it hasn't helped much. I'm eager to understand what's going on and what I might be able to do to alleviate my symptoms.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Bangalore", "region": "Karnataka", "past_conditions": "mild asthma", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter cough syrup", "immunisation_status": null, "allergies": null, "family_history": "respiratory issues", "diet": "balanced diet with fruits and vegetables", "physical_activity": null, "sleep_pattern": "irregular, about 6 hours", "alcohol": "none", "tobacco": "none", "mental_health": "anxiety due to symptoms", "work_stress": "high due to work pressure", "environmental_exposure": "high (pollution)", "housing": "densely populated area", "clean_water": "yes", "occupation": "office worker", "symptom_duration_map": {"cough": 14, "fever": 14}, "symptom_intensity_map": {"cough": "moderate", "fever": "high"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.7, "uid": "a4c51446"}
{"text": "Hello, I am a 34-year-old male from Pune, Maharashtra, and I have been experiencing severe headaches for the past two weeks. Initially, it started as a mild discomfort, but gradually it has worsened over time, making it difficult for me to concentrate on my work. I have a history of occasional headaches, but this has been the most intense I've ever experienced. I've tried over-the-counter pain relievers like paracetamol, but they only provide temporary relief. I do not have any chronic illnesses, and I haven’t had any surgeries or hospitalizations in the past. My diet consists of home-cooked meals, and I generally maintain a moderate level of physical activity by jogging a few times a week. However, I've noticed that the stress at work has been increasing recently due to tight deadlines. I usually sleep for about 6 hours a night, but it's been less lately because of these headaches. I do not consume alcohol or tobacco. In terms of family history, none of my immediate family has suffered from chronic migraines or headaches. I have been immunized as a child, with no known allergies. My living conditions are decent, and I have access to clean water. I am worried that these headaches might be a sign of something more serious, and I would like to get some advice on what to do next.", "extracted": {"age": 34, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers like paracetamol", "immunisation_status": "immunized as a child", "allergies": null, "family_history": "no chronic migraines or headaches", "diet": "home-cooked meals", "physical_activity": "moderate, jogging a few times a week", "sleep_pattern": "about 6 hours a night, less lately", "alcohol": "none", "tobacco": "none", "mental_health": "increased work stress recently", "work_stress": "tight deadlines", "environmental_exposure": null, "housing": "decent", "clean_water": "yes", "occupation": null, "symptom_duration_map": {"headaches": "2 weeks"}, "symptom_intensity_map": {"headaches": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "a3615d39"}
{"text": "Hello, I am a 32-year-old female from Pune, Maharashtra, and I've been experiencing persistent headaches for the past three weeks. Initially, I thought it was just stress from work, as I have a demanding job in IT, and the deadlines have been tight lately. However, the pain has escalated from mild to severe, and I've found it difficult to concentrate or even perform regular tasks. I often feel nausea accompanying the headache, and sometimes it becomes intolerable, forcing me to lie down in a dark room. I've tried over-the-counter pain relievers, but they provide only temporary relief. There's a history of migraines in my family; my mother used to have them frequently. I do not have any chronic illnesses, and I keep active with yoga and jogging, but lately, my physical activity has reduced due to the headaches. I have a fairly balanced diet and do not smoke or drink alcohol. My sleep has been irregular as I often wake up in the middle of the night due to the pain. I live in a relatively clean area with access to safe drinking water, but I'm concerned about the impact of my stress on my mental health. I am looking for advice on how to manage these headaches and whether I should seek medical attention.", "extracted": {"age": 32, "sex": "female", "ethnicity": "South Asian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers", "immunisation_status": null, "allergies": null, "family_history": "family history of migraines", "diet": "balanced diet", "physical_activity": "yoga and jogging", "sleep_pattern": "irregular sleep due to pain", "alcohol": "none", "tobacco": "none", "mental_health": "concern about stress", "work_stress": "high due to tight deadlines", "environmental_exposure": "relatively clean area", "housing": "adequate", "clean_water": "accessible", "occupation": "IT professional", "symptom_duration_map": "3 weeks", "symptom_intensity_map": "severe"}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "fc06cf1d"}
{"text": "I am a 32-year-old woman from Pune, Maharashtra, and for the past two weeks, I have been experiencing a persistent cough accompanied by a low-grade fever that seems to worsen in the evenings. Initially, I thought it was just a common cold, but the cough has become quite severe, making it hard for me to sleep at night. I also have a feeling of tightness in my chest, and I've noticed some fatigue during the day. I don't have any significant past medical history except for occasional allergies to dust, and I am not on any regular medications. While I maintain a balanced diet and exercise moderately, my work in an IT company can be quite stressful, which I suspect might be contributing to my overall health issues. I have not had any surgeries or hospitalizations in the past. Immunization status is up to date, and I do not have any chronic illnesses. I drink alcohol socially but do not smoke, and I live in a somewhat congested area which raises my concern about environmental exposure to pollutants. My family history is fairly normal regarding health, with no major illnesses reported. Given the duration and severity of my symptoms, I feel it’s time to seek medical advice.", "extracted": {"age": 32, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": "allergies to dust", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": "dust", "family_history": "normal health, no major illnesses", "diet": "balanced", "physical_activity": "moderate exercise", "sleep_pattern": "disturbed due to cough", "alcohol": "socially", "tobacco": "none", "mental_health": "stressed due to work", "work_stress": "high", "environmental_exposure": "congested area", "housing": "urban", "clean_water": "yes", "occupation": "IT professional", "symptom_duration_map": {"cough": "14 days", "fever": "14 days", "fatigue": "14 days", "chest tightness": "14 days"}, "symptom_intensity_map": {"cough": "severe", "fever": "low-grade", "fatigue": "moderate", "chest tightness": "mild"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.8, "uid": "79508539"}
{"text": "Hello, I’m a 32-year-old male from Pune, Maharashtra. For the last two weeks, I've been experiencing severe headaches that feel like a pressure build-up, mainly concentrated around my temples. They tend to occur almost daily and can last for hours, often accompanied by nausea and sensitivity to light. I've been managing with over-the-counter pain relievers, but they don't seem to help much anymore. I have a history of migraines since my college days, but this intensity feels different, like something more severe is going on. Moreover, I've been under a lot of work stress lately due to a demanding project at my tech job, and I've noticed that my sleep pattern has also deteriorated; I am often restless at night. Outside of this, I generally maintain a balanced diet, exercise moderately, and have no significant history of major illnesses. I am concerned that these symptoms could affect my day-to-day life and want to understand if I should seek professional help or change any lifestyle factors.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": "migraines", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers, usual for migraines", "immunisation_status": null, "allergies": null, "family_history": null, "diet": "balanced", "physical_activity": "moderate", "sleep_pattern": "restless", "alcohol": "none", "tobacco": "none", "mental_health": "stressed due to work", "work_stress": "high", "environmental_exposure": null, "housing": "urban", "clean_water": "yes", "occupation": "tech worker", "symptom_duration_map": {"headache": 14}, "symptom_intensity_map": {"headache": 8}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "cd073b52"}
{"text": "I’m a 32-year-old woman from Pune, Maharashtra, and I’ve been experiencing severe headaches for the last three weeks. These headaches often start in the morning and worsen throughout the day, making it difficult for me to concentrate at work. I feel a throbbing sensation on one side of my head, often accompanied by nausea and sensitivity to light. I’m not sure if it's related to my lifestyle or stress from my job in IT, but it's becoming unbearable. I’ve been taking over-the-counter pain relievers, but they only provide temporary relief. I have a history of mild migraines in my family, but they were not as severe as what I'm experiencing now. I usually try to maintain a healthy diet, but with my busy schedule, I tend to skip meals. Additionally, I've been feeling more tired lately and have trouble sleeping, which I think could be contributing to my headaches. I haven’t been hospitalized or undergone any surgeries, though I did have a mild case of dengue fever two years ago, which made me quite weak, but I’ve recovered since then. I’m concerned that if this continues, it might affect my work performance and overall well-being, so I’m seeking your advice on what steps I should take next.", "extracted": {"age": 32, "sex": "female", "ethnicity": "null", "socioeconomic_status": "null", "location": "Pune", "region": "Maharashtra", "past_conditions": "dengue fever", "surgeries": "null", "hospitalisations": "null", "chronic_illnesses": "null", "medication_history": "over-the-counter pain relievers", "immunisation_status": "null", "allergies": "null", "family_history": "mild migraines", "diet": "usually healthy", "physical_activity": "null", "sleep_pattern": "trouble sleeping", "alcohol": "null", "tobacco": "null", "mental_health": "null", "work_stress": "high", "environmental_exposure": "null", "housing": "null", "clean_water": "null", "occupation": "IT professional", "symptom_duration_map": "three weeks", "symptom_intensity_map": "severe"}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "cdf7cb0b"}
{"text": "Hello, I am a 32-year-old male from Mysuru, Karnataka. For the past three weeks, I have been experiencing severe headaches that seem to worsen in intensity, particularly in the afternoons. Initially, I thought it was just fatigue or stress from my job as a software engineer, but it has been increasingly difficult to concentrate and go about my daily activities. Along with the headaches, I have also been feeling nauseous and sometimes experience slight dizziness. I don't have any known chronic illnesses or past medical conditions, and I've never had surgery or been hospitalized before. I generally maintain a balanced diet, but I haven't been exercising much lately due to work stress. I occasionally drink alcohol, but I don't smoke or have any allergies that I know of. My sleep pattern has been quite disturbed; I'm only able to get about 5-6 hours of sleep per night. My mental health has been average, but the constant headache is starting to weigh heavily on me. I haven't sought medical attention yet, but I'm beginning to worry if this is something serious or just a prolonged migraine due to working long hours without breaks.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Mysuru", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "balanced", "physical_activity": "low", "sleep_pattern": "disturbed", "alcohol": "occasional", "tobacco": null, "mental_health": "average", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"headache": 21}, "symptom_intensity_map": {"headache": "severe", "nausea": "mild", "dizziness": "mild"}}, "label_leaf_id": "headache_migraine", "risk": 0.8, "uid": "f69f565c"}
{"text": "Hello, my name is Pratik, and I'm a 32-year-old male from Pune in Maharashtra. For the past week, I've been experiencing a persistent and severe headache along with occasional nausea, which has made it difficult for me to concentrate on work. I usually lead a fairly active lifestyle, but now I find it hard to even step out of bed due to the intensity of the pain. I've tried taking over-the-counter pain relievers, but they have not provided any significant relief. There’s no notable family history of migraines, but I do recall some stress at work recently. I don’t smoke or drink alcohol, and my diet consists mainly of vegetarian food. I’ve been sleeping okay, around 6-7 hours a night, but the headaches have disrupted my sleep cycle. Additionally, I haven’t had any prior major health conditions or surgeries, and I am fully vaccinated. I am quite concerned about this headache since it’s been lingering for too long, and I fear it might be something more serious. Overall, I hope to address this issue effectively before it affects my daily life further.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers", "immunisation_status": "fully vaccinated", "allergies": null, "family_history": "no notable migraines", "diet": "vegetarian", "physical_activity": "active lifestyle", "sleep_pattern": "6-7 hours a night", "alcohol": "none", "tobacco": "none", "mental_health": "some work stress", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "office worker", "symptom_duration_map": {"headache": "7 days"}, "symptom_intensity_map": {"headache": "severe", "nausea": "occasional"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "903b13ea"}
{"text": "I am a 30-year-old male from Mumbai, and I've been feeling unwell for the past two weeks. It started with a persistent headache, which I thought was due to work stress, but now it feels like it's getting worse. The pain is often sharp, especially around my forehead, and I've had some nausea accompanying it. I've tried over-the-counter pain medications, but they provide little relief. My sleep has been disturbed too; I'm tossing and turning and rarely getting a full night’s sleep. I work a desk job, and I sit for long hours, leading me to suspect that my physical inactivity might be contributing to my issues. I don't smoke or drink alcohol, and I try to maintain a balanced diet with plenty of vegetables and fruits, although I admit I've been eating more take-away food lately due to my busy schedule. I haven’t had any recent hospitalizations or surgeries, and I don’t have any known chronic illnesses. However, my family has a history of migraines. With the increasing severity of my headache and the nausea, I’m starting to get worried about what it could mean for my health.", "extracted": {"age": 30, "sex": "male", "ethnicity": "null", "socioeconomic_status": "null", "location": "Mumbai", "region": "Maharashtra", "past_conditions": "null", "surgeries": "null", "hospitalisations": "null", "chronic_illnesses": "null", "medication_history": "over-the-counter pain medications", "immunisation_status": "null", "allergies": "null", "family_history": "migraine", "diet": "balanced diet with vegetables and fruits, take-away food lately", "physical_activity": "sedentary desk job", "sleep_pattern": "disturbed; tossing and turning", "alcohol": "none", "tobacco": "none", "mental_health": "work stress", "work_stress": "high; due to desk job", "environmental_exposure": "null", "housing": "null", "clean_water": "null", "occupation": "desk job", "symptom_duration_map": {"headache": "14 days", "nausea": "14 days"}, "symptom_intensity_map": {"headache": "severe", "nausea": "moderate"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "37b906d5"}
{"text": "Hello, I am a 34-year-old male from Pune, Maharashtra. I have been experiencing acute headaches along with a sensation of pressure around my temples, and it's been going on for the past week. The pain intensifies especially in the afternoons and is accompanied by sensitivity to light and noise, which makes it difficult to concentrate at work. I have a stressful job in IT, and I often work long hours, which might contribute to the problem. I haven't had any major health issues in the past except for occasional seasonal allergies, for which I take antihistamines. I’m not on any regular medication, and my immunization status is up to date, including recent vaccinations. I lead a sedentary lifestyle due to my work and typically sleep about 6-7 hours a night, but I don’t believe it's restorative since I'm often waking up feeling fatigued. I don't drink alcohol, but I do smoke occasionally during stressful times. My family has a history of migraines, but no other severe health conditions. I have been trying to manage my stress with yoga, but it hasn't helped much with these headaches. I’m starting to worry, and it’s affecting my productivity. Should I see a doctor, or could this be something I can manage at home?", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": "occasional seasonal allergies", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "antihistamines for allergies", "immunisation_status": "up to date", "allergies": "seasonal allergies", "family_history": "migraines", "diet": null, "physical_activity": "sedentary lifestyle", "sleep_pattern": "6-7 hours, often not restorative", "alcohol": "no", "tobacco": "occasional smoking during stress", "mental_health": "stress from work", "work_stress": "high stress job in IT", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "IT professional", "symptom_duration_map": {"headache": "7 days"}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.6, "uid": "3a9d81a4"}
{"text": "I am a 29-year-old male from Kolkata, West Bengal, and I've been experiencing a severe headache for the past week. The pain is persistent and has escalated to the point where it interferes with my day-to-day activities. I've tried over-the-counter pain relief medications, but they provide only temporary relief. Along with the headache, I have also been feeling nauseous and dizzy at times. I work as a software engineer, which means I often spend long hours in front of a computer. I've not had any major health issues before, and I generally maintain a balanced diet and exercise regularly. However, I've been under a lot of stress at work recently, especially as we are nearing project deadlines. I do not smoke, nor do I drink alcohol. My sleeping patterns have been disrupted due to work stress, as I've been staying up late to meet deadlines. I have no known allergies and my vaccination status is up to date. I have not had any surgeries or hospitalizations in the past. While I do have occasional migraines, they have never been this debilitating. My family history does not indicate any severe chronic illness, and I have not experienced such symptoms before. I would really appreciate some guidance on what steps I should take next, as this headache is affecting my concentration and overall well-being.", "extracted": {"age": 29, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Kolkata", "region": "West Bengal", "past_conditions": "occasional migraines", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relief medications", "immunisation_status": "up to date", "allergies": null, "family_history": "no severe chronic illness", "diet": "balanced diet", "physical_activity": "exercise regularly", "sleep_pattern": "disrupted due to work stress", "alcohol": "none", "tobacco": "none", "mental_health": "work stress", "work_stress": "high due to project deadlines", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"headache": "7 days", "nausea": "occasional", "dizziness": "occasional"}, "symptom_intensity_map": {"headache": "severe", "nausea": "mild", "dizziness": "mild"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "85f230d3"}
{"text": "Hello, I'm a 34-year-old male from Bengaluru, Karnataka. I've been experiencing persistent headaches for over two weeks now. At first, I thought it was just stress from work since I have a demanding job in IT, but the pain has become more intense and now feels like a throbbing sensation on one side of my head, coupled with nausea and occasional sensitivity to light. I usually lead a sedentary lifestyle due to long hours in front of a computer, and I find it difficult to sleep well because of constant worry about deadlines. I don't have any significant past medical history, and I haven't had any surgeries or hospitalisations. My family does have a history of migraines, particularly my mother. I don't smoke, and I only drink social alcohol occasionally, but my diet could be better—I often skip meals and rely on takeout due to my busy schedule. Overall, the headaches are affecting my work performance and quality of life, and I’m concerned about how long this will last and if there’s an underlying condition I should be aware of.", "extracted": {"age": 34, "sex": "male", "ethnicity": null, "socioeconomic_status": "middle", "location": "Bengaluru", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "migraine", "diet": "skips meals, relies on takeout", "physical_activity": "sedentary", "sleep_pattern": "poor sleep due to stress", "alcohol": "social drinker", "tobacco": "non-smoker", "mental_health": "work-related stress", "work_stress": "high stress from deadlines", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "IT professional", "symptom_duration_map": {"headache": "14 days"}, "symptom_intensity_map": {"headache": "severe", "nausea": "moderate", "sensitivity_to_light": "mild"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "bdcbb346"}
{"text": "I am a 36-year-old Indian male from Pune, Maharashtra. For the past week, I've been experiencing a severe headache that seems to worsen as the day progresses. Initially, it was just a mild discomfort, but now it has intensified, often accompanied by nausea and light sensitivity. I have no prior history of migraines or severe headaches, which is why I’m quite worried. I lead a sedentary lifestyle as I work long hours at my desk job and don't exercise much. My sleep has been disrupted; I’m finding it difficult to fall asleep due to the throbbing pain. Additionally, I’m usually very cautious with my diet, but I recently indulged in spicy street food which could have triggered this. I have no known allergies and my family has no history of serious neurological conditions. I’m not taking any medications currently, and my immunization status is up to date. I also don’t smoke or consume alcohol. This headache has kept me from my daily activities and is impacting my work performance, making me feel anxious. I’m really hoping to find out if there is something serious to be concerned about. My environment is generally clean, and I have access to clean water. But with the increasing pollution in Pune, I wonder if that could also be a contributing factor.", "extracted": {"age": 36, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": "up to date", "allergies": null, "family_history": "no serious neurological conditions", "diet": "mostly cautious but recently indulged in spicy street food", "physical_activity": "sedentary lifestyle", "sleep_pattern": "disrupted, difficulty falling asleep", "alcohol": "no", "tobacco": "no", "mental_health": "anxious due to headache", "work_stress": "high due to long hours at desk job", "environmental_exposure": "pollution in Pune", "housing": "clean", "clean_water": "yes", "occupation": "desk job", "symptom_duration_map": {"headache": 7}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "125cd72b"}
{"text": "Hi, I'm 34 years old and I live in Pune, Maharashtra. I've been feeling quite unwell for the past two weeks. It started off with a mild headache, but it quickly escalated into something much worse. My head constantly aches with a sharp throbbing pain, especially when I move or try to focus on anything. I've also experienced some nausea and sensitivity to light, which has made it tough to get through my day-to-day activities. I work in IT and my job usually involves prolonged screen time, which I believe might have contributed to my current condition. I haven't had any major illnesses in the past, and I don't take regular medication. I do occasionally get mild seasonal allergies, but nothing severe. My family has no history of migraines, but they do have cases of hypertension. I try to maintain a balanced diet, but I've been eating less recently due to the headache. I stay fairly active, exercising three times a week, but I haven't been able to do any of that lately because of how I feel. My sleep has also been disrupted; I'm either tossing and turning or waking up too early due to discomfort. I don't smoke or drink, and I have no other chronic illnesses. I've been drinking plenty of water and generally live in a clean environment, but everything seems to be getting harder each day with this headache. I'm really worried about it and just want to feel normal again.", "extracted": {"age": 34, "sex": null, "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": [], "surgeries": null, "hospitalisations": null, "chronic_illnesses": [], "medication_history": [], "immunisation_status": null, "allergies": ["seasonal allergies"], "family_history": ["hypertension"], "diet": "balanced", "physical_activity": "fairly active, exercising three times a week", "sleep_pattern": "disrupted, tossing and turning", "alcohol": "no", "tobacco": "no", "mental_health": null, "work_stress": "high due to IT job with prolonged screen time", "environmental_exposure": null, "housing": "clean environment", "clean_water": "yes", "occupation": "IT professional", "symptom_duration_map": {"headache": 14}, "symptom_intensity_map": {"headache": "severe", "nausea": "mild", "sensitivity_to_light": "moderate"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "e7d4105f"}
{"text": "Hello, I have been experiencing a severe cough along with a fever that started about two weeks ago. Initially, I thought it was just a common cold, but the symptoms have worsened significantly. The cough is persistent and painful, and it disrupts my sleep almost every night. I've also been feeling fatigued and occasionally have chills. I live in Delhi and frequently commute in crowded metro trains, which I suspect could be a factor in catching an infection. I haven't had any significant medical issues in the past, nor have I undergone any surgeries or hospitalisations. My parents have a history of respiratory issues, and I’ve had a slight allergy to dust. I generally maintain a balanced diet, but due to the illness, my appetite has decreased quite a bit. I work a high-stress job in IT, which can take a toll on my mental health sometimes. I rarely consume alcohol and do not smoke. Lately, my sleep pattern has been disrupted owing to the coughing, and I'm concerned that it might be something serious. I would like advice on whether I should see a doctor or take any specific interim measures until then.", "extracted": {"age": null, "sex": null, "ethnicity": null, "socioeconomic_status": null, "location": "Delhi", "region": "North India", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": "dust allergy", "family_history": "respiratory issues", "diet": "balanced diet, decreased appetite due to illness", "physical_activity": null, "sleep_pattern": "disrupted due to coughing", "alcohol": "rarely", "tobacco": "no", "mental_health": "high work stress", "work_stress": "high", "environmental_exposure": "crowded metro trains", "housing": null, "clean_water": null, "occupation": "IT professional", "symptom_duration_map": {"cough": "2 weeks", "fever": "2 weeks", "fatigue": "2 weeks", "chills": "occasional"}, "symptom_intensity_map": {"cough": "severe", "fever": "severe", "fatigue": "moderate", "chills": "mild"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.8, "uid": "0bb0c092"}
{"text": "Hello, I'm a 32-year-old man and I've been experiencing severe headaches for the past two weeks. The pain usually starts in the morning and intensifies throughout the day, making it difficult for me to concentrate at work. I work in a marketing firm in Mumbai, and the stress from my job, combined with my irregular sleep pattern (typically around 5-6 hours a night), seems to exacerbate the headaches. I often feel nauseated, especially when I try to focus on my computer screen, and sometimes the pain radiates to my neck. In terms of my health history, I haven't had any major illnesses or surgeries, and I'm generally healthy aside from these recent headaches. However, I have a family history of migraines—my mother suffers from them frequently. I don't have any known allergies, and I don't smoke or consume alcohol. I try to eat a balanced diet, but my hectic work schedule sometimes leads to skipping meals or relying on quick snacks. I'm reaching out because I'm concerned that the headaches might be related to my work stress or an underlying health issue, and I would appreciate any guidance on what steps to take next.", "extracted": {"age": 32, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "migraine", "diet": "balanced, sometimes skip meals", "physical_activity": null, "sleep_pattern": "irregular, 5-6 hours a night", "alcohol": "no", "tobacco": "no", "mental_health": "stress from work", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "marketing professional", "symptom_duration_map": {"headache": 14}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "c1eeb9af"}
{"text": "I am a 34-year-old male living in a small town in Maharashtra. Recently, I've been experiencing severe headaches that started about two weeks ago. They began as mild discomfort but have escalated into full-blown migraines, making it difficult for me to concentrate at work. I have a desk job in a local manufacturing company, and the stress from my deadlines has been overwhelming. I try to eat a balanced diet, mostly vegetarian, and I engage in light physical activity like walking on weekends. However, with the headache constantly nagging me, I find it hard to stick to my routine. I occasionally consume alcohol during social gatherings, but I don’t smoke or have any known allergies. I haven’t had any major surgeries, and I don't have a history of hospitalizations. There’s no significant history of chronic illnesses in my family, except for my father who had high blood pressure. I have been under a lot of stress lately, especially with the rising workload, and I'm worried that this might be contributing to my migraines. Also, I've noticed my sleep hasn't been great; I’m struggling to fall asleep at night and often wake up feeling unrested. I’m not sure if this is just temporary stress or if I should be concerned about these headaches persistently affecting my daily life.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Maharashtra", "region": "Western India", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": "father with high blood pressure", "diet": "vegetarian", "physical_activity": "light walking on weekends", "sleep_pattern": "poor, trouble falling asleep", "alcohol": "occasional", "tobacco": "none", "mental_health": "stressed", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "desk job in manufacturing", "symptom_duration_map": {"headache": 14}, "symptom_intensity_map": {"headache": 8}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "622238dc"}
{"text": "I'm a 32-year-old male from Pune, Maharashtra, and for the past two weeks, I have been experiencing persistent headaches that I just can't shake off. Initially, it started as a dull ache, but over the last few days, it's become increasingly severe. I often feel it around my temples and sometimes it's so intense that it affects my concentration at work as a software engineer. I’ve tried over-the-counter pain relievers, but they don’t seem to help much. I don't have any known chronic illnesses, but I occasionally suffer from allergies, particularly during the monsoon when dust and mold levels rise. My lifestyle isn't the healthiest; I work long hours in front of a computer, don't exercise regularly, and I only get about 5-6 hours of sleep each night. I sometimes rely on caffeinated drinks to stay awake during the day, which I’m beginning to think might be affecting my sleep quality. I’m concerned that this headache could be a sign of something more serious, so I decided to consult a healthcare professional about it.", "extracted": {"age": 32, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["non-prescription pain relievers"], "immunisation_status": null, "allergies": ["dust", "mold"], "family_history": null, "diet": null, "physical_activity": "low", "sleep_pattern": "5-6 hours per night", "alcohol": null, "tobacco": null, "mental_health": null, "work_stress": "high", "environmental_exposure": "high during monsoon season", "housing": null, "clean_water": null, "occupation": "software engineer", "symptom_duration_map": {"headache": "2 weeks"}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "d9f3bcf8"}
{"text": "I'm a 32-year-old female from Pune, Maharashtra, and for the past week, I have been experiencing a severe headache that doesn't seem to go away. Initially, I thought it was just stress or fatigue from work, but it has become quite intense and is accompanied by nausea and sensitivity to light. I generally maintain a balanced diet and try to stay active, but I've felt very low on energy lately. I have no significant past medical conditions or surgeries, and I don't take any regular medication. My family history doesn't include major health issues. I've been under a bit of work stress lately, but I haven't felt overly anxious or depressed. I usually sleep well, but the headache has been impacting my sleep quality, leading me to feel exhausted. I drink alcohol occasionally during social gatherings and do not smoke, so I don't think those are contributing to my situation. Given the severity and the drug-free duration of my symptoms, I'm increasingly concerned and would like to know if I should seek medical attention or if it's something that might resolve on its own.", "extracted": {"age": 32, "sex": "female", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "balanced", "physical_activity": "active", "sleep_pattern": "poor due to headache", "alcohol": "occasionally", "tobacco": "no", "mental_health": "normal", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": null, "symptom_duration_map": {"headache": 7}, "symptom_intensity_map": {"headache": "severe", "nausea": null, "sensitivity_to_light": null}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "9bc26295"}
{"text": "Hello, I am a 35-year-old female living in Pune, Maharashtra. For the past two weeks, I have been experiencing a persistent cough and occasional fever. The cough is quite severe, making it difficult for me to sleep at night. I’ve tried taking over-the-counter cough syrups, but they don’t seem to relieve my symptoms at all. I also feel fatigued and sometimes experience chills. I'm generally healthy but had a mild case of bronchitis two years ago, which was treated. I work in an IT office and my job can be quite stressful at times. I have no known allergies to medications but my family has a history of asthma and allergies. I try to maintain a balanced diet and usually exercise a few times a week, but recently I’ve just felt too weak and tired to keep up with my routine. I live in an apartment with access to clean water, but the air quality in Pune hasn’t been great, which makes me wonder if it’s affecting my condition. I haven’t traveled recently, and I am fully vaccinated against common infections, including the flu. Overall, I am quite worried since my cough has persisted for so long without improvement, and I’m not sure if I need to visit a doctor or if there’s something more I can do from home to feel better.", "extracted": {"age": 35, "sex": "female", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": ["bronchitis"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["over-the-counter cough syrups"], "immunisation_status": "fully vaccinated", "allergies": null, "family_history": ["asthma", "allergies"], "diet": "balanced diet", "physical_activity": "a few times a week", "sleep_pattern": "disrupted due to cough", "alcohol": null, "tobacco": null, "mental_health": "work stress", "work_stress": "high", "environmental_exposure": "poor air quality", "housing": "apartment", "clean_water": "yes", "occupation": "IT professional", "symptom_duration_map": {"cough": 14, "fever": 14}, "symptom_intensity_map": {"cough": "severe", "fever": "mild"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.8, "uid": "59b82818"}
{"text": "I'm a 35-year-old male from Pune, Maharashtra, and I've been experiencing a persistent headache for the last two weeks. It started off mild but has progressively worsened to the point where it’s now severe and sometimes accompanied by nausea. I work a desk job and, lately, there's been quite a bit of stress due to tight deadlines, which I think might be contributing to my headache. My sleep pattern has been somewhat irregular, averaging about 5-6 hours a night, and I often wake up feeling drained. On top of that, I'm not particularly active and tend to skip meals. I don’t have any chronic illnesses or a history of serious hospitalizations, but I did have a bout of migraine a few years ago triggered by stress and lack of sleep. My family has a history of migraines, and I wonder if that’s a factor here. I don’t use tobacco or consume alcohol, but I do drink a lot of caffeinated beverages every day. Overall, it feels like my body is under a lot of pressure, and I’m hoping to find some relief soon as there’s a lot going on in both my personal and work life.", "extracted": {"age": 35, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": ["migraine"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": ["migraine"], "diet": "irregular meals", "physical_activity": "low", "sleep_pattern": "irregular, 5-6 hours a night", "alcohol": "none", "tobacco": "none", "mental_health": "stressed", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "desk job", "symptom_duration_map": {"headache": "2 weeks"}, "symptom_intensity_map": {"headache": "severe", "nausea": "mild"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "2f38212e"}
{"text": "Hello, I am a 34-year-old male from Pune, Maharashtra. For the past two weeks, I've been experiencing a persistent and severe cough that seems to worsen at night. Initially, I thought it was just the change in weather, but it’s now accompanied by a low-grade fever and difficulty breathing sometimes. I’ve tried over-the-counter medications, but they haven't helped much. I don't have any other significant past medical conditions, and I haven’t had any recent surgeries or hospitalisations. I maintain a generally healthy diet, eat plenty of vegetables and drink water, but my sleep has been disrupted due to the coughing. I work long hours as a software engineer, which sometimes adds to my stress levels, and I do not smoke or consume alcohol. I haven't had any immunisations recently other than the routine ones. My family has a history of asthma, so I’m quite concerned that it might be something similar. I would really appreciate some guidance on what steps I should take next.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter medications", "immunisation_status": "routine immunisations", "allergies": null, "family_history": "asthma", "diet": "healthy, plenty of vegetables", "physical_activity": null, "sleep_pattern": "disrupted due to coughing", "alcohol": "none", "tobacco": "none", "mental_health": null, "work_stress": "high due to long hours", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"cough": 14, "fever": 14, "difficulty_breathing": 7}, "symptom_intensity_map": {"cough": "severe", "fever": "low-grade", "difficulty_breathing": "moderate"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.8, "uid": "0041694c"}
{"text": "Hello, I am a 34-year-old male from Mumbai, Maharashtra. For the past two weeks, I've been experiencing intense headaches that seem to worsen by the end of the day. It often feels like a throbbing pain primarily on one side of my head, and at times I experience nausea alongside it. I've tried over-the-counter pain relievers, but they provide minimal relief. Additionally, I've been feeling unusually fatigued and have trouble concentrating at work. I work in a stressful IT job, which might be contributing to my situation. Although I have no prior chronic illnesses or significant surgeries, I do have a family history of migraines, as my mother suffers from them. My sleep pattern has been irregular lately, averaging about 5 to 6 hours of sleep each night, and I sometimes consume alcohol socially, but I do not smoke or have any other known allergies. My diet mainly consists of vegetarian food, and I try to stay active by exercising a few times a week, but I feel like my physical activity has decreased since the start of these headaches. The pain intensity is around 7/10 when it's at its worst, and the frequency is around four times a week. I’m becoming increasingly worried if this could indicate something more serious, and I would really appreciate any guidance regarding the next steps I should take for my health.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Mumbai", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers", "immunisation_status": null, "allergies": null, "family_history": "family history of migraines", "diet": "vegetarian", "physical_activity": "exercises a few times a week", "sleep_pattern": "irregular, about 5-6 hours of sleep", "alcohol": "socially", "tobacco": "none", "mental_health": "stress from work", "work_stress": "high stress IT job", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "IT professional", "symptom_duration_map": {"duration": "2 weeks"}, "symptom_intensity_map": {"intensity": "7/10"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "da9ef5f8"}
{"text": "Hello, I am a 32-year-old female from Bangalore, and I have been experiencing a persistent and severe cough for the past two weeks. Initially, it felt like a common cold, but it has progressively worsened, leading to difficulties in breathing and chest tightness. I've also developed a mild fever, which fluctuates throughout the day. I'm worried because I have a history of asthma, and with the change in weather, my symptoms have been exacerbated. I've not had any surgeries or recent hospitalizations but I've been using an inhaler regularly. I do not have any known allergies and my family does not have any history of lung diseases. My diet consists mainly of vegetarian meals, and I try to stay active with jogging a few times a week. However, my sleep has been affected lately due to the coughing and I feel a bit stressed with work deadlines piling up. I do not consume alcohol or tobacco, but the air quality in my area has been poor lately, which might be contributing to my condition. I am quite anxious about what this could mean, and I am looking for some guidance on how to manage these symptoms effectively.", "extracted": {"age": 32, "sex": "female", "ethnicity": null, "socioeconomic_status": null, "location": "Bangalore", "region": "Karnataka", "past_conditions": "asthma", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "inhaler", "immunisation_status": null, "allergies": null, "family_history": null, "diet": "vegetarian", "physical_activity": "jogging", "sleep_pattern": "poor", "alcohol": "no", "tobacco": "no", "mental_health": "anxiety", "work_stress": "high", "environmental_exposure": "poor air quality", "housing": null, "clean_water": null, "occupation": null, "symptom_duration_map": {"cough": "14 days", "fever": "14 days"}, "symptom_intensity_map": {"cough": "severe", "breathlessness": "moderate", "chest tightness": "moderate", "fever": "mild"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.7, "uid": "18718f40"}
{"text": "Hello, I am a 28-year-old male from Pune, Maharashtra, and I've been struggling with some troubling symptoms for the past few weeks. Initially, it started as a mild headache, but it has since intensified, causing a lot of discomfort. Along with the headaches, I've also been experiencing episodes of nausea and occasional light sensitivity. I work in a high-stress job in IT, which may be contributing to the problem. Although I usually maintain a balanced diet and try to exercise regularly, the stress has impacted my routine. My sleep pattern has worsened, averaging around four to five hours each night. I have no significant past medical history, no known allergies, and my family generally maintains good health. I do not consume alcohol or smoke tobacco, and I have not had any surgeries or hospitalisations in the past. There’s no history of chronic illnesses in my immediate family either. However, I am starting to feel anxious about these symptoms, wondering if they could lead to something more serious. I have not seen a doctor yet but feel like it might be time to seek professional help if the symptoms persist.", "extracted": {"age": 28, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune, Maharashtra", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": null, "diet": "balanced diet", "physical_activity": "regular exercise", "sleep_pattern": "poor, 4-5 hours/night", "alcohol": "none", "tobacco": "none", "mental_health": "anxious", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "IT professional", "symptom_duration_map": {"headache": "weeks", "nausea": "weeks", "light sensitivity": "weeks"}, "symptom_intensity_map": {"headache": "intensifying", "nausea": "occasional", "light sensitivity": "occasional"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "c3e0c9b8"}
{"text": "Hello, I'm a 28-year-old woman living in Bangalore, Karnataka. For the past three weeks, I've been experiencing persistent headaches that seem to come and go, but they have been becoming increasingly severe. Initially, I thought it might be due to stress from work as I often deal with tight deadlines as a software engineer, but now it's been hard to concentrate, and I sometimes feel nauseous. The pain usually starts at my temples and spreads, making it tough to engage in my normal activities. I don't have any significant past medical history or chronic illnesses, and I haven't had any surgeries. I occasionally take over-the-counter pain relief medication, but it hasn't been very effective recently. I try to eat a balanced diet and maintain a decent sleep schedule, though the headaches have been affecting my sleep. I don’t smoke, drink alcohol socially, and I don’t have any known allergies. My family has a history of migraines, and I wonder if that could be a contributing factor. Overall, I feel worried since this is not usual for me, and I’m unsure whether I should seek further medical attention or if there are other lifestyle changes I can make to alleviate the headache.", "extracted": {"age": 28, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle class", "location": "Bangalore", "region": "Karnataka", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relief medications occasionally", "immunisation_status": null, "allergies": null, "family_history": "family has a history of migraines", "diet": "balanced diet", "physical_activity": null, "sleep_pattern": "decent sleep schedule, affected recently", "alcohol": "socially", "tobacco": "no", "mental_health": null, "work_stress": "tight deadlines as a software engineer", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"headache": 21}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "94c3bad5"}
{"text": "Hello, I'm a 32-year-old Indian woman living in Pune, Maharashtra. For the past two weeks, I have been experiencing persistent fatigue and severe headaches, accompanied by a throbbing pain on one side of my head, which seems to worsen during the evenings. Initially, I brushed it off as stress from work since I recently started a demanding job in marketing. However, it's now making it difficult for me to concentrate and complete my tasks, and I've even missed a few days of work because of it. I have no prior history of migraines or chronic headaches, but I do tend to have high-stress levels at times. My work-life balance has been off lately, and I've been drinking less water, which is unlike me. I've tried taking over-the-counter pain relievers, but they provide only temporary relief. Although I don't have any known allergies, my family has a history of migraines, especially on my mother's side. I generally have a sedentary lifestyle as I'm often sitting in front of a computer for hours, and I can’t say that I have a well-balanced diet either. I would appreciate any guidance on what could be the cause of my symptoms and how I can manage them better.", "extracted": {"age": 32, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": null, "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers", "immunisation_status": null, "allergies": null, "family_history": "migraines", "diet": "poor", "physical_activity": "sedentary", "sleep_pattern": null, "alcohol": "none", "tobacco": "none", "mental_health": "stressed", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "marketing", "symptom_duration_map": {"headache": "2 weeks"}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "d5240d84"}
{"text": "Hello, I am a 35-year-old male from Pune, Maharashtra, and I've been experiencing some alarming health issues lately. It started with a persistent headache about a month ago, which I initially brushed off as stress-related due to my busy job in software development. However, it has since progressed to severe migraines that make it difficult for me to concentrate at work, and some days I can hardly get out of bed. Along with the headache, I have also had episodes of nausea and light sensitivity. My family has a history of migraine, and I occasionally experienced mild headaches in the past, but nothing like this before. I lead a fairly sedentary lifestyle due to my work, and my diet includes a lot of convenience foods, which I suspect may not be helping. I drink alcohol occasionally and do not smoke. My sleep has been disrupted lately; I often struggle to get a full night's rest, and my stress levels have increased significantly due to work. I haven’t had any major surgeries or hospitalizations, but I had a bout of flu last winter. I’m worried that these symptoms might be pointing to something more serious, and I am seeking guidance on how best to proceed with these debilitating headaches.", "extracted": {"age": 35, "sex": "male", "ethnicity": null, "socioeconomic_status": null, "location": "Pune", "region": "Maharashtra", "past_conditions": ["migraines"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": null, "family_history": ["migraine"], "diet": "convenience foods", "physical_activity": "sedentary", "sleep_pattern": "disrupted, difficulty sleeping", "alcohol": "occasionally", "tobacco": "no", "mental_health": "increased stress", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": null, "occupation": "software developer", "symptom_duration_map": {"headache": "30 days", "nausea": "ongoing", "light sensitivity": "ongoing"}, "symptom_intensity_map": {"headache": "severe", "nausea": "moderate", "light sensitivity": "moderate"}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "ab435564"}
{"text": "Hello, I'm a 34-year-old male living in Bangalore, and I've been experiencing severe headaches for the past two weeks. These headaches often feel like they are right at the top of my head, and sometimes they spread to one side of my face, making it quite difficult for me to concentrate on my work. I am a software engineer, and the work-related stress might have contributed to my condition. My sleep pattern has not been great lately, as I’ve been staying up late to meet project deadlines, and I suspect that this is affecting my health as well. I do not have any chronic illnesses that I know of, and I've never had surgery. My past medical history has been relatively normal, but I occasionally suffer from seasonal allergies, particularly to dust and pollen. I do not drink alcohol or smoke, and I try to maintain a balanced diet, though I admit my physical activity regime has taken a backseat due to work pressure. I am concerned that if these headaches continue, it could severely impact my productivity and well-being, so I thought it best to seek some advice.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Bangalore", "region": "Karnataka", "past_conditions": "seasonal allergies", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": null, "immunisation_status": null, "allergies": "dust and pollen", "family_history": null, "diet": "balanced", "physical_activity": "low", "sleep_pattern": "poor", "alcohol": "no", "tobacco": "no", "mental_health": null, "work_stress": "high", "environmental_exposure": "high dust exposure", "housing": "urban apartment", "clean_water": "yes", "occupation": "software engineer", "symptom_duration_map": {"headache": 14}, "symptom_intensity_map": {"headache": 8}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "fa8a0f95"}
{"text": "Hello, I'm a 32-year-old woman from Jaipur, Rajasthan, and I have been feeling unwell for the past two weeks. Initially, it started with a low-grade fever and a constant cough, but over time, the cough has worsened, becoming more severe and persistent. I also experience fatigue and occasional body aches, which make it difficult for me to carry out my daily activities. I have no known allergies and have never undergone any surgeries. In the past, I have had some respiratory infections, but I have never been hospitalized. I do take multivitamins occasionally but am not on any other regular medication. My past immunisation records are up to date, and I have no significant family history of chronic diseases. I am not an alcoholic and do not smoke, but I do feel stressed at work as I'm a school teacher and have been managing a heavy workload. My diet consists of balanced meals; however, I often skip breakfast due to time constraints. With the ongoing symptoms, I feel worried and confused about whether this is something serious or just a common infection that requires rest and some over-the-counter medication. I would appreciate any advice on what I should do next as my condition is not improving, and I'm beginning to feel quite anxious about it.", "extracted": {"age": 32, "sex": "female", "ethnicity": "Indian", "socioeconomic_status": "middle-class", "location": "Jaipur", "region": "Rajasthan", "past_conditions": ["respiratory infections"], "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": ["multivitamins"], "immunisation_status": "up to date", "allergies": null, "family_history": null, "diet": "balanced meals", "physical_activity": null, "sleep_pattern": null, "alcohol": "no", "tobacco": "no", "mental_health": "stressed", "work_stress": "high", "environmental_exposure": null, "housing": null, "clean_water": "yes", "occupation": "school teacher", "symptom_duration_map": {"fever": "14 days", "cough": "14 days", "fatigue": "14 days", "body aches": "14 days"}, "symptom_intensity_map": {"fever": "mild", "cough": "severe", "fatigue": "moderate", "body aches": "mild"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.7, "uid": "35721476"}
{"text": "Hello, my name is Rajesh, and I live in Pune, Maharashtra. For the past two weeks, I've been experiencing a persistent cough and a mild fever that seems to get worse in the evenings. I've tried over-the-counter cough syrups, but they haven't provided much relief. Initially, I thought it might just be a common cold, but the cough is quite severe now, making it difficult for me to sleep at night. I am 34 years old, male, and I work as an IT consultant. I'm generally healthy with no chronic illnesses; however, I do have a history of seasonal allergies, which makes me concerned that this could be related. I haven't had any recent hospitalizations or surgeries, but I worry about the possibility of it being something more serious since my father had asthma. My diet is mostly vegetarian, and I try to stay active, but lately, the fatigue from this cough has limited my physical activity. I don’t smoke or consume alcohol, and my mental health is generally good, though I have been feeling more stressed with work deadlines lately. I live in a rented apartment where I have access to clean water. It’s just concerning since the symptoms aren’t going away. I would really appreciate any guidance on how to handle this, especially since my symptoms seem to be intensifying.", "extracted": {"age": 34, "sex": "male", "ethnicity": "Indian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": "seasonal allergies", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter cough syrups", "immunisation_status": null, "allergies": "seasonal allergies", "family_history": "father had asthma", "diet": "vegetarian", "physical_activity": "limited due to fatigue from cough", "sleep_pattern": "poor due to cough", "alcohol": "none", "tobacco": "none", "mental_health": "generally good", "work_stress": "increased due to deadlines", "environmental_exposure": null, "housing": "rented apartment with clean water", "occupation": "IT consultant", "symptom_duration_map": {"cough": "14", "fever": "14"}, "symptom_intensity_map": {"cough": "severe", "fever": "mild"}}, "label_leaf_id": "fever_cough_long_severe", "risk": 0.8, "uid": "68af973a"}
{"text": "I am a 35-year-old woman from Pune, Maharashtra, and I have been experiencing persistent headaches for the past three weeks now. Initially, I thought they were just the result of stress from work, as I have been handling an increased workload lately. The pain has been quite severe; it often makes it hard for me to concentrate on my tasks, sometimes accompanied by nausea and sensitivity to light and sound. I do not have any previous history of migraines, but I have suffered from occasional tension headaches in the past. My family has a history of migraines, particularly my mother, who often experiences severe headaches herself. I try to maintain a balanced diet, but the irregular work hours can lead to skipped meals. I usually exercise a couple of times a week, but with my current workload, my physical activity has decreased. I drink alcohol socially, but I don’t smoke. My sleep pattern has been poor lately, averaging just 5-6 hours of sleep at night, which I suspect has contributed to my condition. I’ve tried over-the-counter pain relievers, but they only provide temporary relief. I am becoming increasingly concerned about these headaches and am seeking advice on what could be the underlying cause and how to effectively manage or treat this issue.", "extracted": {"age": 35, "sex": "female", "ethnicity": "Asian", "socioeconomic_status": "middle", "location": "Pune", "region": "Maharashtra", "past_conditions": "none", "surgeries": null, "hospitalisations": null, "chronic_illnesses": null, "medication_history": "over-the-counter pain relievers", "immunisation_status": "up-to-date", "allergies": "none", "family_history": "mother with migraines", "diet": "balanced but irregular", "physical_activity": "decreased", "sleep_pattern": "poor", "alcohol": "social", "tobacco": "none", "mental_health": "stress from work", "work_stress": "high", "environmental_exposure": "urban", "housing": "apartment", "clean_water": "yes", "occupation": "professional work", "symptom_duration_map": {"duration_in_weeks": 3}, "symptom_intensity_map": {"pain_level": 8}}, "label_leaf_id": "headache_migraine", "risk": 0.7, "uid": "420c33f2"}
{"text": "I'm a 29-year-old woman from Pune, Maharashtra, and for the past week, I have been experiencing severe headaches that seem to be getting worse. Initially, it felt like a simple tension headache, but it has progressed to a pounding pain, particularly on the left side of my head. Along with the headache, I’ve also experienced some nausea, and bright lights seem to make the pain sharper. I haven't had any major health issues in the past, so this feels particularly worrying. I typically lead a healthy lifestyle; I eat a balanced diet and exercise regularly, but the pain has been affecting my sleep, leading to further exhaustion. I have no known allergies, and no one in my family has a history of migraines or severe headaches; most of them rarely complain of headaches. I think work stress might be a factor since I've been dealing with tight deadlines lately, and I often find myself staring at screens for too long. I don’t drink alcohol or smoke, but I realize that I haven't been sleeping well during this busy period. I haven't consulted a doctor yet, but the intensity of the headache is becoming unbearable, and I'm concerned about what might be causing it.", "extracted": {"age": 29, "sex": "female", "ethnicity": "null", "socioeconomic_status": "null", "location": "Pune", "region": "Maharashtra", "past_conditions": "null", "surgeries": "null", "hospitalisations": "null", "chronic_illnesses": "null", "medication_history": "null", "immunisation_status": "null", "allergies": "none", "family_history": "no family history of migraines or severe headaches", "diet": "balanced diet", "physical_activity": "regular exercise", "sleep_pattern": "poor sleep due to pain and stress", "alcohol": "none", "tobacco": "none", "mental_health": "experiencing work stress", "work_stress": "experiencing tight deadlines", "environmental_exposure": "null", "housing": "null", "clean_water": "null", "occupation": "null", "symptom_duration_map": {"headache": 7}, "symptom_intensity_map": {"headache": "severe"}}, "label_leaf_id": "headache_migraine", "risk": 0.8, "uid": "2b0fbff3"}
